In [2]:
import pandas as pd

In [3]:
# Import libraries
import seaborn as sns
import pandas as pd

# Load Titanic dataset
df = sns.load_dataset("titanic")

# Show first 10 rows
print("First 10 rows of Titanic dataset:")
df.head(10)

Matplotlib is building the font cache; this may take a moment.

First 10 rows of Titanic dataset:

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
5,0,3,male,NaN,0,0,8.4583,Q,Third,man,True,NaN,Queenstown,no,True
6,0,1,male,54.0,0,0,51.8625,S,First,man,True,E,Southampton,no,True
7,0,3,male,2.0,3,1,21.0750,S,Third,child,False,NaN,Southampton,no,False
8,1,3,female,27.0,0,2,11.1333,S,Third,woman,False,NaN,Southampton,yes,False
9,1,2,female,14.0,1,0,30.0708,C,Second,child,False,NaN,Cherbourg,yes,False

In [10]:
print(df.isnull().sum())

survived         0
pclass           0
sex              0
age            177
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
deck           688
embark_town      2
alive            0
alone            0
dtype: int64

In [13]:
print(df.shape)

(891, 15)

In [18]:
import seaborn as sns

df = sns.load_dataset("titanic")

print("Before:", df.shape)

df_clean = df.dropna(axis=0, how="any")

print("After:", df_clean.shape)

Before: (891, 15)
After: (182, 15)

In [24]:
df_clean.duplicated().sum()

np.int64(0)

In [26]:
df_clean.duplicated().sum()

np.int64(0)

In [27]:
df_clean = df.drop_duplicates()

In [28]:
df_clean.shape

(784, 15)